2024-4-24/f5d7284cca-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 17:05 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>linux physical_memory.rst</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">linux physical_memory.rst</h1>
<ol class="org-ol">
<li>sizeof(struct page) = 64</li>
<li>pnf_to_page and page_to_pnf采用vmemmap使用虚拟映射内存映射来优化</li>
<li>vmemmap是struct page *类型，指向一个虚拟连续的struct page对象阵列。</li>
<li>pfn是vmemmap数组索引，可以直接获得目标page</li>
<li>vmemmap范围分配：</li>
</ol>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">sparse_init</span>():
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">sparse_init_nid</span>():
        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__populate_section_memmap</span>():
            <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">vmemmap_populate</span>():
                <span style="font-weight: bold;">pass</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold; font-style: italic;">__init</span> sparse_init_nid(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">nid</span>, <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">long</span> <span style="font-weight: bold; font-style: italic;">pnum_begin</span>,
                                   <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">long</span> <span style="font-weight: bold; font-style: italic;">pnum_end</span>,
                                   <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">long</span> map_count)
{
        <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">mem_section_usage</span> *<span style="font-weight: bold; font-style: italic;">usage</span>;
        <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">long</span> <span style="font-weight: bold; font-style: italic;">pnum</span>;
        <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">page</span> *<span style="font-weight: bold; font-style: italic;">map</span>;

        usage = sparse_early_usemaps_alloc_pgdat_section(NODE_DATA(nid),
                        mem_section_usage_size() * map_count);

        sparse_buffer_init(map_count * section_map_size(), nid);
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#24320;&#22987;&#36941;&#21382;&#65292;&#27599;&#27425;2^17&#20010;page&#65292;&#36941;&#21382;8&#27425;: 8 * 2^17 * 4k = 2^32 = 4G</span>
        for_each_present_section_nr(pnum_begin, pnum) {
                <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">long</span> <span style="font-weight: bold; font-style: italic;">pfn</span> = section_nr_to_pfn(pnum);

                <span style="font-weight: bold;">if</span> (pnum &gt;= pnum_end)
                        <span style="font-weight: bold;">break</span>;
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#33719;&#21462;&#20174;vmemmap&#24320;&#22987;&#30340;&#34394;&#25311;&#22320;&#22336;&#20197;&#21450;&#23545;&#24212;&#23384;&#25918;struct page&#30340;&#29289;&#29702;&#22320;&#22336;</span>
                map = __populate_section_memmap(pfn, PAGES_PER_SECTION,
                                nid, <span style="font-weight: bold; text-decoration: underline;">NULL</span>, <span style="font-weight: bold; text-decoration: underline;">NULL</span>);

                check_usemap_section_nr(nid, usage);
                sparse_init_one_section(__nr_to_section(pnum), pnum, map, usage,
                                SECTION_IS_EARLY);
                usage = (<span style="font-weight: bold; text-decoration: underline;">void</span> *) usage + mem_section_usage_size();
        }
        sparse_buffer_fini();
        <span style="font-weight: bold;">return</span>;
}
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 17:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
